Revit 2027 API
SizingOptions.DomainType Property
 The domain type of the options, such as HVAC or Plumbing.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorDomainType DomainType { get; set; }
Public Property DomainType As ConnectorDomainType
	Get
	Set
public:
property ConnectorDomainType DomainType {
	ConnectorDomainType get ();
	void set (ConnectorDomainType value);
}
member DomainType : ConnectorDomainType with get, set
Property Value
ConnectorDomainType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace